[{"url": "https://www.allrecipes.com/recipe/232397/homemade-ketchup/", "name": "Homemade Ketchup", "ingredients": ["2 (28 ounce) cans crushed tomatoes", "½ cup water, divided", "⅔ cup white sugar", "¾ cup distilled white vinegar", "1 teaspoon onion powder", "½ teaspoon garlic powder", "1 ¾ teaspoons salt", "⅛ teaspoon celery salt", "⅛ teaspoon mustard powder", "¼ teaspoon finely ground black pepper", "1  whole clove"], "steps": ["Pour tomatoes into slow cooker. Swirl 1/4 cup water in each emptied can and pour into the slow cooker. Add sugar, vinegar, onion powder, garlic powder, salt, celery salt, mustard powder, black pepper, cayenne pepper, and whole clove; whisk to combine.\n\n\n\n\n\n\n\n\n\n\n\nDotdash Meredith Food Studios", "Cook on High, uncovered, until mixture is reduced by half and very thick, 10 to 12 hours. Stir every hour or so.\n\n\n\n\n\n\n\n\n\n\n\nDotdash Meredith Food Studios", "Use an immersion blender for about 20 seconds to smooth the texture of the ketchup.\n\n\n\n\n\n\n\n\n\n\n\nDotdash Meredith Food Studios", "Ladle ketchup into a fine strainer and press mixture with the back of a ladle to strain out any skins and seeds.\n\n\n\n\n\n\n\n\n\n\n\nDotdash Meredith Food Studios", "Transfer strained ketchup to a bowl. Cool completely.", "Taste and adjust salt, black pepper, and cayenne pepper as desired.\n\n\n\n\n\n\n\n\n\n\n\nDotdash Meredith Food Studios"], "rating": null, "prep_time": "10 mins", "cook_time": "12 hrs", "total_time": "12 hrs 10 mins", "nb_servings": "48"}, {"url": "https://www.allrecipes.com/recipe/21542/sweet-and-sour-fish/", "name": "Sweet and Sour Fish", "ingredients": ["1 pound halibut", "1 tablespoon soy sauce", "1 tablespoon all-purpose flour", "2 cups oil for deep frying", "1 tablespoon vegetable oil", "1 medium green bell pepper, diced", "1 medium onion, diced", "1 (8 ounce) can pineapple chunks, juice reserved", "3 tablespoons ketchup", "1 ½ tablespoons white sugar", "1 tablespoon water", "2 teaspoons all-purpose flour", "1 teaspoon sesame oil", "salt to taste"], "steps": ["Cut halibut into bite-sized pieces. Place in a mixing bowl and combine with soy sauce and 1 tablespoon of flour. Let stand for 30 minutes.", "Meanwhile, heat oil in deep-fryer or heavy saucepan to 375 degrees F (190 degrees C).", "Deep-fry halibut pieces until golden brown. Drain on paper towels; set aside.", "Make sauce: Heat oil in a medium skillet over medium heat. Add bell pepper, onion, and pineapple chunks and sauté for 1 minute. Stir in pineapple juice, ketchup, sugar, water, 2 teaspoons flour, sesame oil, and salt. Cook until thickened, stirring occasionally, 5 to 10 minutes.", "Pour the sauce over the halibut pieces to serve, or serve halibut alongside the sauce for dipping."], "rating": null, "prep_time": "10 mins", "cook_time": "20 mins", "total_time": "1 hrs", "nb_servings": "3"}, {"url": "https://www.allrecipes.com/recipe/263384/spicy-shrimp-pad-thai/", "name": "Spicy Shrimp Pad Thai", "ingredients": ["1 (8 ounce) package dried rice noodles", "2 teaspoons peanut oil", "1 small onion, diced", "2 cloves garlic, minced", "3 tablespoons rice wine vinegar", "3 tablespoons ketchup", "3 tablespoons fish sauce", "3 tablespoons sweet chile sauce", "2 tablespoons creamy peanut butter", "1 tablespoon light soy sauce", "1 tablespoon fresh lime juice", "1 tablespoon white sugar", "1 teaspoon red pepper flakes", "½ teaspoon cayenne pepper", "12  uncooked medium shrimp, peeled and deveined", "2  eggs, lightly beaten", "1 cup unsalted dry-roasted peanuts, chopped", "½ pound bean sprouts", "¼ cup shredded carrots (Optional)", "½  lime, cut into wedges", "¼ cup chopped green onions", "¼ cup coarsely chopped cilantro"], "steps": ["Place noodles in a large bowl and cover with hot water. Set aside until noodles are softened, about 15 minutes. Drain and rinse thoroughly.", "Heat oil in a wok over medium heat. Cook and stir onion and garlic until onion is translucent, about 5 minutes.", "Combine rice wine vinegar, ketchup, fish sauce, chile sauce, peanut butter, soy sauce, lime juice, sugar, red pepper flakes, and cayenne pepper together in a bowl. Set aside.", "Add shrimp to the wok. Cook and stir until pink, about 4 minutes. Add the ketchup mixture and stir. Move all ingredients to one side to clear a small space in the pan. Pour in eggs and cook without stirring until partially set, about 3 minutes.", "Stir the drained noodles into the shrimp and egg mixture. Add 1/2 cup peanuts, 1/4 cup bean sprouts, and carrots. Cook and stir until noodles are heated through, about 2 minutes. Garnish with the remaining peanuts, bean sprouts, lime wedges, green onions, and cilantro."], "rating": null, "prep_time": "30 mins", "cook_time": "20 mins", "total_time": "50 mins", "nb_servings": "4"}, {"url": "https://www.allrecipes.com/recipe/280255/julias-korean-fried-chicken/", "name": "Julia's Korean-Fried Chicken", "ingredients": ["3 cups canola oil for frying", "3 ¾ pounds chicken drumsticks", "1 tablespoon grated fresh ginger, or more to taste", "1 teaspoon kosher salt", "1 cup potato starch, or as needed", "½ cup gochujang (Korean hot pepper paste)", "¼ cup oyster sauce", "3 tablespoons mirin (Japanese sweet wine)", "2 tablespoons ketchup", "1 tablespoon fish sauce", "2 teaspoons grated garlic", "1 ½ teaspoons white sesame seeds", "1 ½ teaspoons black sesame seeds"], "steps": ["Preheat the oven to 200 degrees F (95 degrees C). Set a rack on a foil-lined baking sheet.", "Pour oil into a 10-inch cast iron skillet. Clip a candy thermometer to the side of the skillet. Heat over medium-high heat until oil reaches 375 degrees F (190 degrees C), about 10 minutes.", "Meanwhile, toss chicken, ginger, and salt together in a large bowl until evenly coated. Spread 1/2 cup potato starch in a shallow dish; dredge chicken to coat completely and evenly. Add remaining 1/2 cup potato starch as needed. Shake off excess and transfer to a plate.", "Add chicken to the skillet carefully, working in batches; fry until lightly golden, 2 to 3 minutes. Turn chicken over and fry until an instant-read thermometer inserted into the thickest part registers 175 degrees F (80 degrees C), 2 to 3 minutes more. Transfer to the rack on the prepared baking sheet. Reheat oil between batches to 375 degrees F (190 degrees C).", "Return chicken to the skillet in batches and fry again, about 2 minutes per side.", "Stir gochujang, oyster sauce, mirin, ketchup, fish sauce, and garlic together in a large bowl. Add cooked chicken and toss to coat. Sprinkle with white and black sesame seeds."], "rating": null, "prep_time": "15 mins", "cook_time": "35 mins", "total_time": "50 mins", "nb_servings": "6"}, {"url": "https://www.allrecipes.com/recipe/68917/crispy-baked-basa/", "name": "Crispy Baked Basa", "ingredients": ["¼ cup mayonnaise", "1 tablespoon stone ground mustard", "1 teaspoon capers", "1 teaspoon ketchup", "¼ teaspoon paprika", "¼ teaspoon hot pepper sauce", "1 pound swai fish", "1 ½ tablespoons olive oil", "1 cup finely crushed plain Melba toast rounds", "salt and pepper to taste", "1 clove garlic, minced", "1  lemon, sliced"], "steps": ["Preheat oven to 375 degrees F (190 degrees C).", "In a bowl, thoroughly blend the mayonnaise, mustard, capers, ketchup, paprika, and hot pepper sauce.", "Brush the basa fillets with about 1 tablespoon olive oil, and roll in the crushed Melba toast to coat. Season with salt and pepper. Use a kitchen sprayer to lightly spray the coated fish with remaining olive oil. Arrange the fish in a baking dish and top with garlic and lemon slices.", "Bake 15 minutes in the preheated oven, or until fish is easily flaked with a fork and coating is lightly browned. Serve with the mayonnaise sauce mixture."], "rating": null, "prep_time": "15 mins", "cook_time": "15 mins", "total_time": "30 mins", "nb_servings": "4"}, {"url": "https://www.allrecipes.com/recipe/70486/kellis-baked-halibut/", "name": "Kelli's Baked Halibut", "ingredients": ["1 pound halibut fillets", "¾ cup all-purpose flour", "½ cup low-fat creamy salad dressing (e.g. Miracle Whip™)", "1 ½ cups crushed saltine crackers", "garlic salt to taste", "ground black pepper to taste", "1 pinch seasoning salt"], "steps": ["Preheat the oven to 375 degrees F (190 degrees C). Rinse fish fillets with water, and pat dry with paper towels.", "In a shallow bowl, mix together the cracker crumbs, garlic salt, pepper and seasoning salt. Set aside. Coat the fish fillets with flour, shaking off the excess, and place in a baking dish. Coat the tops of the fillets with salad dressing, then press on a layer of seasoned cracker crumbs. Flip over, and repeat on the other side.", "Bake for 25 minutes in the preheated oven, until fish is white and flakes easily with a fork."], "rating": null, "prep_time": "10 mins", "cook_time": "30 mins", "total_time": "40 mins", "nb_servings": "4"}, {"url": "https://www.allrecipes.com/recipe/263521/sticky-garlic-pork-chops/", "name": "Sticky Garlic Pork Chops", "ingredients": ["⅓ cup light brown sugar", "6 cloves garlic, crushed, or more to taste", "¼ cup rice vinegar", "2 tablespoons fish sauce", "1 tablespoon soy sauce", "1 tablespoon ketchup", "½ teaspoon freshly ground black pepper", "2 teaspoons hot sauce, or to taste", "2 (10 ounce) thick-cut bone-in pork chops", "1 teaspoon vegetable oil"], "steps": ["Combine brown sugar, garlic, rice vinegar, and fish sauce in a bowl for the marinade. Add a splash of soy sauce and a plop of ketchup. Finish off with black pepper and hot sauce.", "Pour 1/2 of the marinade into a baking dish and lay pork chops over marinade. Pour the remaining marinade on top and toss pork chops until well coated. Wrap with plastic wrap and marinate in the refrigerator, flipping chops every 30 minutes, 1 to 2 hours.", "Remove chops to a plate, scraping any excess marinade back into the baking dish.", "Heat oil in a nonstick skillet over medium heat. Place chops in the hot oil. Cook until outsides are nicely charred and meat springs back when lightly prodded, about 5 minutes per side. Remove chops to a plate to rest.", "Pour the marinade into the skillet. Raise heat to medium-high. Cook until marinade is reduced and sticky, 3 to 5 minutes. Return pork chops and any accumulated juices to the skillet.", "Reduce heat to medium-low. Cook pork chops, flipping and basting occasionally, until the centers are slightly pink and sauce is to your desired degree of stickiness, 6 to 8 minutes. An instant-read thermometer inserted into the thickest part of the pork should read about 145 degrees F (63 degrees C).", "Plate each pork chop and spoon a portion of the sticky garlic sauce on top.\n\n\n\n\n\n\n\n\n\n\n\nChef John"], "rating": null, "prep_time": "10 mins", "cook_time": "20 mins", "total_time": "1 hrs 30 mins", "nb_servings": "2"}, {"url": "https://www.allrecipes.com/recipe/8405347/filipino-style-barbecue-chicken/", "name": "Filipino-Style Barbecue Chicken", "ingredients": ["1 medium very ripe banana, mashed", "¼ cup tomato paste", "¼ cup apple cider vinegar", "2 tablespoons brown sugar", "2 teaspoons vegetable oil", "2 teaspoons freshly grated ginger", "½ teaspoon onion powder", "¼ teaspoon garlic powder", "¼ teaspoon cayenne pepper", "¼ teaspoon kosher salt, or to taste", "⅛ teaspoon ground allspice", "⅛ teaspoon ground turmeric", "¼ cup water", "½ cup prepared banana ketchup", "¾ cup lemon-lime soda (such as 7-Up®)", "½ cup soy sauce", "4 cloves crushed garlic", "2 tablespoons brown sugar", "1 teaspoon freshly ground black pepper", "1 medium lemon, juiced", "2 ½ pounds skinless, boneless chicken thighs, cut in half", "3 tablespoons reserved banana ketchup", "3 tablespoons soy sauce", "1 tablespoon brown sugar", "1 tablespoon vegetable oil", "1 teaspoon fish sauce"], "steps": ["Mash ripe banana, tomato paste, vinegar, brown sugar, oil, ginger, onion powder, garlic powder, cayenne, salt, allspice, and turmeric together in a saucepan. Add water and stir to combine.", "Place over medium-high heat and bring to a simmer. Stir to combine. Reduce heat to medium and simmer until reduced and thickened, 7 to 10 minutes. Remove from heat; reserve 3 tablespoons for the basting sauce, leaving about 1/2 cup for the marinade.", "Transfer ½ cup banana ketchup to a bowl and add lemon-lime soda, soy sauce, garlic, brown sugar, black pepper, and lemon juice for the marinade. Whisk until combined. Add halved chicken thighs and toss to coat.", "Cover with plastic wrap and marinate in the refrigerator for 4 to 18 hours.", "When you are ready to cook the chicken, combine reserved 3 tablespoons banana ketchup, soy sauce, brown sugar, oil, and fish sauce in a small bowl for basting sauce.", "Preheat a charcoal grill until coals are very hot.", "Remove chicken from the refrigerator and place on metal skewers, folding in half with the smooth side on the outside, the rougher side folded in.", "Grill chicken over hot coals until no longer pink in the centers, 15 to 20 minutes, turning and basting every 2 to 3 minutes. Serve with accumulated juices or extra basting sauce.\n\n\n\n\n\n\n\n\n\n\n\nFilipino-Style Barbecue Chicken.\nChef John"], "rating": null, "prep_time": "15 mins", "cook_time": "30 mins", "total_time": "4 hrs 45 mins", "nb_servings": "6"}]