[{"url": "https://www.allrecipes.com/recipe/40384/chicken-florentine-rice-casserole/", "name": "Chicken Florentine Rice Casserole", "ingredients": ["3 cups water", "4 cubes  chicken bouillon", "2 cups instant brown rice", "2 tablespoons cornstarch", "¼ cup olive oil", "4  boneless, skinless chicken breast halves", "1 teaspoon dried thyme", "1 teaspoon dried sage", "2 teaspoons dried basil", "1 teaspoon dried parsley", "1 teaspoon dried marjoram", "1  medium onion, chopped", "2 (10 ounce) packages frozen chopped spinach, thawed and drained", "2 cups cottage cheese", "salt and pepper to taste", "½ cup Parmesan cheese", "¼ cup margarine"], "steps": ["Preheat oven to 350 degrees F (175 degrees C).", "In a medium saucepan, boil 2 cups water and chicken bouillon. Stir in rice. Remove from heat, and set aside. In a small bowl, mix cornstarch with remaining water.", "Heat olive oil in a medium skillet over medium heat. Place chicken in skillet with thyme, sage, basil, parsley, and marjoram. Cook until chicken is no longer pink and juices run clear. Drain and cube.", "Stir onion into the skillet, and cook 5 minutes, or until browned and tender.", "In a large bowl, thoroughly mix rice, cornstarch mixture, chicken, onion, spinach, and cottage cheese.", "Transfer the mixture to a medium baking dish. Season with salt and pepper. Top with Parmesan cheese, and dot with margarine. Bake, covered, 45 minutes in the preheated oven. Remove cover, and continue baking 15 minutes, until surface is lightly browned."], "rating": null, "prep_time": "30 mins", "cook_time": "1 hrs", "total_time": "1 hrs 30 mins", "nb_servings": "8"}, {"url": "https://www.allrecipes.com/recipe/257998/bills-peruvian-chicken-and-rice/", "name": "Bill's Peruvian Chicken and Rice", "ingredients": ["2 tablespoons white wine vinegar", "2 tablespoons extra-virgin olive oil", "2 tablespoons minced garlic", "1 tablespoon paprika", "1 tablespoon ground cumin", "1 teaspoon lemon juice", "1 teaspoon sea salt", "¼ teaspoon ground black pepper", "¼ teaspoon chile powder", "2  onions, diced", "3  skinless, boneless chicken breasts, diced", "2 cups chicken broth", "1 cup basmati rice, rinsed", "1 ½ teaspoons minced garlic", "1 ½ teaspoons extra-virgin olive oil", "½ teaspoon ground cumin", "½ teaspoon dried cilantro", "½ teaspoon sea salt", "¼ teaspoon ground black pepper", "½ cup frozen peas"], "steps": ["Preheat oven to 425 degrees F (220 degrees C).", "Mix vinegar, 2 tablespoons olive oil, 2 tablespoons garlic, paprika, 1 tablespoon cumin, lemon juice, 1 teaspoon salt, 1/4 teaspoon black pepper, and chile powder in a large bowl. Add onions and chicken; stir to coat.", "Transfer chicken mixture to a casserole dish.", "Roast in the preheated oven, stirring occasionally, until chicken is no longer pink in the center, about 45 minutes. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).", "Combine chicken broth, basmati rice, 1 1/2 teaspoon garlic, 1 1/2 teaspoon olive oil, 1/2 teaspoon cumin, cilantro, 1/2 teaspoon sea salt, and 1/4 teaspoon black pepper in a saucepan. Bring to a boil; reduce heat, cover, and simmer until rice is tender, 20 to 25 minutes.", "Bring a small pot of water to a boil; add frozen peas. Cook and stir until bright green, 3 to 5 minutes. Stir peas into the rice. Serve rice alongside chicken."], "rating": null, "prep_time": "20 mins", "cook_time": "1 hrs 18 mins", "total_time": "1 hrs 38 mins", "nb_servings": "4"}, {"url": "https://www.allrecipes.com/recipe/237084/lemon-parmesan-chicken-and-rice-bowl/", "name": "Lemon-Parmesan Chicken and Rice Bowl", "ingredients": ["1 cup rice", "5 tablespoons vegetable oil, divided", "2 cups hot water", "1 (8 ounce) package frozen broccoli", "salt and ground black pepper to taste", "2 pounds skinless, boneless chicken breast, cut into 1-inch cubes", "1 ½ teaspoons garlic powder", "1 ½ teaspoons onion powder", "1 large onion, diced", "1  lemon, zested and juiced", "½ cup grated Parmesan cheese"], "steps": ["Preheat oven to 400 degrees F (200 degrees C).", "Heat an oven-safe pot over medium-high heat; stir rice and 2 tablespoons oil together in the hot saucepan to coat the rice with oil. Pour hot water over the rice; bring to a boil and place a cover on the pot.", "Bake rice in preheated oven until the water is absorbed and rice is tender, 12 to 15 minutes.", "Place broccoli into a large pot and cover with salted water; bring to a boil. Reduce heat to medium-low and simmer until tender, 5 to 7 minutes. Drain and season broccoli with salt and pepper.", "Heat remaining oil in a skillet over medium-high heat; add chicken to hot oil, season with garlic powder and onion powder. Saute chicken until completely browned, 5 to 7 minutes.", "Stir onion into the chicken; continue cooking until onions are soft and translucent, 5 to 7 minutes.", "Spoon rice into the skillet; cook until lightly browned on the bottom, about 3 minutes. Stir broccoli into the rice mixture; sprinkle lemon zest and lemon juice over the mixture and stir. Top with Parmesan cheese.\n\n\n\n\n\n\n\n\n\n\n\nDotdash Meredith Food Studios"], "rating": null, "prep_time": "10 mins", "cook_time": "30 mins", "total_time": "40 mins", "nb_servings": "5"}, {"url": "https://www.allrecipes.com/recipe/235796/a-homemade-san-francisco-treat-chicken-vermicelli-rice/", "name": "A Homemade San Francisco Treat: Chicken Vermicelli Rice", "ingredients": ["1 tablespoon butter", "1 cup white rice", "¼ cup broken pieces vermicelli pasta", "3 cups water", "1 tablespoon chicken bouillon granules", "2 teaspoons dried parsley", "¼ teaspoon garlic powder", "¼ teaspoon onion powder"], "steps": ["Melt butter in a large saucepan over medium heat. Cook rice and vermicelli in hot butter until browned, about 3 minutes.", "Pour water over rice mixture. Stir in chicken bouillon, parsley, garlic powder, and onion powder; bring to a boil.", "Cover the saucepan, reduce heat to low, and cook until water is absorbed, about 25 minutes."], "rating": null, "prep_time": "5 mins", "cook_time": "30 mins", "total_time": "35 mins", "nb_servings": "4"}, {"url": "https://www.allrecipes.com/recipe/231193/simply-delicious-chicken-rice-soup/", "name": "Simply Delicious Chicken Rice Soup", "ingredients": ["4 cups water", "1  skinless, boneless chicken breast half", "½  leek, sliced", "½ small onion, finely chopped", "1  carrot, sliced", "1 stalk celery, sliced", "1 ½ cubes  chicken bouillon", "¼ teaspoon ground thyme", "¼ teaspoon poultry seasoning", "freshly ground black pepper to taste", "4 cups reduced-sodium chicken broth", "½ cup white rice"], "steps": ["Bring water to a boil in a large pot; add chicken breast, leek, onion, carrot, celery, chicken bouillon, thyme, poultry seasoning, and black pepper. Simmer until chicken is no longer pink in the center, about 20 minutes. Remove chicken from pot and shred.", "Return chicken to the pot and stir in chicken broth and rice. Continue to simmer until rice is tender, about 30 minutes more, stirring occasionally."], "rating": null, "prep_time": "20 mins", "cook_time": "50 mins", "total_time": "1 hrs 10 mins", "nb_servings": "4"}, {"url": "https://www.allrecipes.com/recipe/239788/chef-johns-chicken-lettuce-wraps/", "name": "Chef John's Chicken Lettuce Wraps", "ingredients": ["1 ½ pounds skinless, boneless chicken thighs, coarsely chopped", "1 (8 ounce) can water chestnuts, drained and minced", "1 cup diced shiitake mushroom caps", "½ cup minced yellow onion", "⅓ cup chopped green onion", "1 tablespoon soy sauce", "1 tablespoon freshly grated ginger", "2 teaspoons brown sugar", "¼ cup chicken stock", "¼ cup rice wine vinegar", "4 cloves garlic, minced", "1 tablespoon ketchup", "1 tablespoon soy sauce", "2 teaspoons sesame oil", "2 teaspoons brown sugar", "½ teaspoon red pepper flakes", "½ teaspoon dry mustard", "2 tablespoons vegetable oil", "1 ½ tablespoons chopped fresh cilantro, or to taste", "1 ½ tablespoons chopped fresh basil, or to taste", "1 ½ tablespoons chopped green onion, or to taste", "16 leaves iceberg lettuce, or as needed"], "steps": ["Stir chicken, water chestnuts, mushrooms, yellow onion, 1/3 cup green onion, 1 tablespoon soy sauce, ginger, and 2 teaspoons brown sugar together in a bowl. Pat mixture down, cover the bowl with plastic wrap, and refrigerate until ready to use.", "Whisk chicken stock, rice wine vinegar, garlic, ketchup, 1 tablespoon soy sauce, sesame oil, 2 teaspoons brown sugar, red pepper flakes, and dry mustard together in a bowl until glaze is well-mixed.", "Heat vegetable oil in a heavy nonstick skillet over high heat. Cook and stir chicken mixture in hot oil until chicken no longer looks raw, about 2 minutes. Pour 1/2 of the glaze mixture into chicken mixture; cook and stir over high heat until chicken begins to caramelize and brown, 10 to 15 minutes.", "Reduce heat to medium-low, pour remaining glaze into chicken mixture, and cook until heated through and slightly reduced, about 3 minutes more. Stir in cilantro, basil, and 1 1/2 tablespoons green onion. Transfer chicken mixture to a bowl and serve with lettuce leaves to wrap."], "rating": null, "prep_time": "35 mins", "cook_time": "15 mins", "total_time": "50 mins", "nb_servings": "8"}, {"url": "https://www.allrecipes.com/recipe/240220/rotisserie-chicken-and-stuffing-casserole/", "name": "Rotisserie Chicken and Stuffing Casserole", "ingredients": ["cooking spray", "1 ½ cups water", "¼ cup butter", "1 (6 ounce) package quick-cooking stuffing mix (such as Stove Top®), or more to taste", "1 tablespoon butter", "1 medium onion, diced", "3 stalks celery, diced, or more to taste", "1 (10.5 ounce) can  low-sodium cream of chicken soup", "½ (10.5 ounce) can  low-sodium cream of mushroom soup", "1 (8 ounce) container sour cream", "1 whole cooked rotisserie chicken - skinned, boned, and meat shredded", "salt and ground black pepper to taste"], "steps": ["Preheat the oven to 375 degrees F (190 degrees C). Spray a 9x13-inch baking dish with cooking spray.\n\n\n\n\n\n\n\n\n\n\n\nDotdash Meredith Food Studios.", "Bring water and 1/4 cup butter to a boil in a saucepan over medium heat. Add stuffing mix and stir to combine. Remove the saucepan from the heat, cover, and let sit until water is absorbed, about 5 minutes. Fluff stuffing with a fork.\n\n\n\n\n\n\n\n\n\n\n\nDotdash Meredith Food Studios\n\n\n\n\n\n\n\n\n\n\n\n\nDotdash Meredith Food Studios", "While you are preparing stuffing, melt 1 tablespoon butter in a skillet over medium heat. Add onion and celery; cook and stir until softened, 5 to 10 minutes.", "Mix both condensed soups with sour cream in a bowl until well combined.\n\n\n\n\n\n\n\n\n\n\n\nDotdash Meredith Food Studios", "Spread shredded chicken in the bottom of the prepared baking dish. Layer onion mixture over chicken and season with salt and pepper.\n\n\n\n\n\n\n\n\n\n\n\nDotdash Meredith Food Studios\n\n\n\n\n\n\n\n\n\n\n\n\nDotdash Meredith Food Studios", "Top with soup mixture and spread stuffing evenly over top.\n\n\n\n\n\n\n\n\n\n\n\nDotdash Meredith Food Studios\n\n\n\n\n\n\n\n\n\n\n\n\nDotdash Meredith Food Studios", "Bake in the preheated oven until filling is bubbly and topping is golden brown, about 1 hour.\n\n\n\n\n\n\n\n\n\n\n\nDotdash Meredith Food Studios", "Serve hot and enjoy!\n\n\n\n\n\n\n\n\n\n\n\nDOTDASH MEREDITH FOOD STUDIOS "], "rating": null, "prep_time": "15 mins", "cook_time": "1 hrs 10 mins", "total_time": "1 hrs 25 mins", "nb_servings": "8"}, {"url": "https://www.allrecipes.com/recipe/177797/slow-simmered-chicken-rice-soup/", "name": "Slow-Simmered Chicken Rice Soup", "ingredients": ["½ cup uncooked wild rice", "½ cup uncooked regular long-grain white rice", "1 tablespoon vegetable oil", "5 ¼ cups Swanson® Chicken Broth (regular, Natural Goodness™ or Certified Organic)", "2 teaspoons dried thyme leaves, crushed", "¼ teaspoon crushed red pepper", "2 stalks celery, coarsely chopped", "1 medium onion, chopped", "1 pound skinless, boneless chicken breast, cut into cubes", "1 (16 ounce) container sour cream", "¼ cup chopped green onion"], "steps": ["Stir the wild rice, white rice and oil in a 3 1/2-quart slow cooker. Cover and cook on HIGH for 15 minutes.", "Add the broth, thyme, red pepper, celery, onion and chicken to the cooker. Turn the heat to LOW. Cover and cook for 7 to 8 hours (or on HIGH for 4 to 5 hours) or until the chicken is cooked through.", "Serve with the sour cream and green onions, if desired."], "rating": null, "prep_time": "10 mins", "cook_time": "7 hrs 15 mins", "total_time": "7 hrs 25 mins", "nb_servings": "8"}, {"url": "https://www.allrecipes.com/recipe/212940/chicken-arroz-caldo-chicken-rice-porridge/", "name": "Chicken Arroz Caldo (Chicken Rice Porridge)", "ingredients": ["2 tablespoons olive oil", "1  onion, diced", "2 cloves garlic, crushed", "1 (2 inch) piece fresh ginger, peeled and thinly sliced", "2 ¼ pounds chicken wings, split and tips discarded", "1 tablespoon fish sauce (Optional)", "5 ¼ cups chicken broth", "1 cup glutinous sweet rice", "salt and pepper to taste", "1  green onion, chopped", "1  lemon, sliced (Optional)", "1 teaspoon fish sauce for sprinkling, if desired (Optional)"], "steps": ["Heat oil in a large pot over medium heat. Cook and stir onion, garlic, and ginger in hot oil until fragrant, about 5 minutes. Add chicken wings; cook and stir for 1 minute. Stir in fish sauce, cover, and cook another 2 minutes.", "Pour chicken broth into the pot. Stir in sweet rice and bring mixture to a boil. Cover and cook for 10 minutes, stirring occasionally to prevent rice from sticking to the bottom of the pot. Season with salt and pepper.", "Portion soup into bowls and garnish with green onion. Serve with lemon slices and additional fish sauce, if desired."], "rating": null, "prep_time": "20 mins", "cook_time": "20 mins", "total_time": "40 mins", "nb_servings": "5"}, {"url": "https://www.allrecipes.com/recipe/9057/chicken-bog/", "name": "Chicken Bog", "ingredients": ["6 cups water", "1 (3 pound) whole chicken", "1 medium onion, chopped", "1 tablespoon salt", "3 ½ cups chicken broth", "½ pound smoked sausage of your choice, sliced", "1 cup long-grain white rice", "2 tablespoons Italian-style seasoning", "2 cubes  chicken bouillon"], "steps": ["Bring water, chicken, onion, and salt to a boil in a large pot over medium heat. Reduce the heat, cover, and simmer until chicken is no longer pink at the bone and the juices run clear, about 1 hour. An instant-read thermometer inserted into the thickest part of the thigh, near the bone, should read at least 165 degrees F (74 degrees C).", "Transfer chicken to a cutting board to cool for 10 to 15 minutes. Skim and discard fat from cooking liquid. Measure 3 1/2 cups cooking liquid and place into a 6-quart saucepan. Discard remaining cooking liquid.", "Remove and discard chicken skin and bones. Chop meat into bite-sized pieces.", "Add chicken to the cooking liquid in the saucepan. Add sausage, rice, Italian seasoning, and bouillon. Set over medium-low heat and cook for 30 minutes. Reduce the heat to low, cover, and cook, stirring often, until thickened to desired consistency, 10 to 20 more minutes."], "rating": null, "prep_time": "20 mins", "cook_time": "1 hrs 45 mins", "total_time": "2 hrs 15 mins", "nb_servings": "6"}, {"url": "https://www.allrecipes.com/recipe/145572/thai-spicy-basil-chicken-fried-rice/", "name": "Thai Spicy Basil Chicken Fried Rice", "ingredients": ["3 tablespoons oyster sauce", "2 tablespoons fish sauce", "1 teaspoon white sugar", "½ cup peanut oil for frying", "6 large cloves garlic clove, crushed", "2  serrano peppers, crushed", "1 pound boneless, skinless chicken breast, cut into thin strips", "1  red bell pepper, thinly sliced", "1  onion, thinly sliced", "4 cups cooked jasmine rice, chilled", "2 cups sweet Thai basil", "1  cucumber, sliced (Optional)", "½ cup cilantro sprigs (Optional)"], "steps": ["Whisk together oyster sauce, fish sauce, and sugar in a small bowl; set aside.", "Heat oil in a wok over medium-high heat until oil begins to smoke. Add garlic and serrano peppers, stirring quickly. Stir in chicken, bell pepper, onion, and oyster sauce mixture; cook until chicken is no longer pink in the center and the juices run clear.", "Increase heat to high and stir in chilled rice; stir quickly until sauce is well blended with rice. Use the back of a spoon to break up any rice sticking together.", "Remove the wok from heat. Stir in basil leaves. Garnish with sliced cucumber and cilantro.\n\n\n\n\n\n\n\n\n\n\n\nspiderman0521"], "rating": null, "prep_time": "30 mins", "cook_time": "10 mins", "total_time": "40 mins", "nb_servings": "6"}, {"url": "https://www.allrecipes.com/recipe/278028/instant-pot-chicken-and-rice-soup/", "name": "Instant Pot Chicken and Rice Soup", "ingredients": ["1 ½ cups low-sodium chicken broth", "⅓ cup brown rice", "1 ½ pounds chicken breast tenderloins, cubed", "1 large onion, diced", "1 ½ cups diced carrot", "1 ½ cups diced celery", "1 cup frozen corn kernels", "1 teaspoon garlic powder", "1 teaspoon onion powder", "1 teaspoon poultry seasoning", "½ teaspoon dried thyme", "½ teaspoon salt", "½ teaspoon ground black pepper", "½ cup half-and-half", "2 teaspoons cornstarch", "½ cup frozen peas"], "steps": ["Stir broth and brown rice together in a multi-functional pressure cooker (such as Instant Pot) until rice is moistened. Add chicken, onion, carrot, celery, corn, garlic powder, onion powder, poultry seasoning, thyme, salt, and pepper. Close and lock the lid. Select high pressure and set the timer for 18 minutes. Allow 10 to 15 minutes for pressure to build.", "Release pressure naturally, about 10 minutes. Carefully release remaining pressure using the quick-release method, 2 to 3 minutes. Remove the lid.", "Stir half-and-half and cornstarch together in a small bowl; stir into the cooker along with frozen peas. Select Sauté function; cook, stirring constantly, until thickened and bubbly, 2 to 3 minutes."], "rating": null, "prep_time": "25 mins", "cook_time": "30 mins", "total_time": "1 hrs 10 mins", "nb_servings": "4"}, {"url": "https://www.allrecipes.com/recipe/247306/bbq-chicken-veggies-and-rice-skillet/", "name": "BBQ Chicken, Veggies, and Rice Skillet", "ingredients": ["1 tablespoon olive oil", "½  onion, chopped", "1  red bell pepper, chopped", "1 pound skinless, boneless chicken breast halves, cut into 1/2-inch cubes", "Salt to taste", "Ground black pepper to taste", "¼ cup barbecue sauce", "2 cups water", "1 (5.5 ounce) package Knorr® Rice Sides™ - Rice Pilaf", "1 tablespoon buttery spread", "1 cup frozen corn kernels, thawed, or fresh corn kernels", "1  green onion (green tops only), sliced"], "steps": ["Heat olive oil in a large skillet over medium-high heat. When oil is hot, add onion and bell pepper and cook and stir until onion becomes translucent, about 2 minutes.", "Season chicken with salt and pepper and add to the skillet. Sauté until it begins to brown, 2 to 4 minutes. Add barbecue sauce and stir until combined. Transfer mixture to a bowl.", "Add water, rice pilaf package, and buttery spread to the skillet and bring to a boil. Cover and reduce heat to medium-low; continue cooking for 5 minutes.", "Stir in corn; cover and cook an additional 2 minutes. Return chicken mixture to the pan; stir to mix thoroughly. Remove from heat and let stand for about 2 minutes.", "Serve topped with chopped green onions."], "rating": null, "prep_time": "5 mins", "cook_time": "15 mins", "total_time": "20 mins", "nb_servings": "4"}, {"url": "https://www.allrecipes.com/recipe/229321/homey-chicken-and-rice-casserole/", "name": "Homey Chicken and Rice Casserole", "ingredients": ["1 cup rice", "1 ¼ cups chicken broth", "2 tablespoons olive oil", "2 cups sliced white mushrooms", "1 small onion, chopped", "2 cups shredded cooked chicken", "1 (10.75 ounce) can  fat-free cream of chicken soup", "1 cup light sour cream", "½ cup milk", "½ cup chicken broth", "1 tablespoon seasoned salt (such as LAWRY'S®)", "ground black pepper to taste", "1 cup shredded Cheddar cheese", "¼ cup crushed garlic-and-butter flavor croutons"], "steps": ["Preheat oven to 350 degrees F (175 degrees C). Grease a 9-inch square baking dish.", "Bring rice and 1 1/4 cup chicken broth to a boil in a saucepan. Reduce heat to medium-low, cover, and simmer until the rice is tender and the liquid has been absorbed, 20 to 25 minutes.", "Heat olive oil in a saucepan over medium heat. Cook and stir mushrooms and onion in hot oil until mushrooms are soft and onion is translucent, 5 to 7 minutes. Stir chicken, chicken soup, sour cream, milk, 1/2 cup chicken broth, seasoned salt, and black pepper into the mushroom mixture. Reduce heat to low. Add cooked rice to the saucepan; stir until rice is evenly mixed in. Transfer mixture to prepared baking dish.", "Bake in preheated oven 15 minutes. Top casserole with Cheddar cheese and crushed croutons; bake until top begins to brown, about another 10 minutes. Let cool 5 minutes before serving."], "rating": null, "prep_time": "20 mins", "cook_time": "50 mins", "total_time": "1 hrs 15 mins", "nb_servings": "4"}, {"url": "https://www.allrecipes.com/recipe/231291/hearty-chicken-and-rice-soup/", "name": "Hearty Chicken and Rice Soup", "ingredients": ["10 cups chicken broth", "1  onion, chopped", "1 cup sliced celery", "1 cup sliced carrots", "¼ cup snipped parsley", "½ teaspoon cracked black pepper", "½ teaspoon dried thyme leaves", "1  bay leaf", "¾ pound chicken, cut into cubes", "2 cups cooked rice", "2 tablespoons lime juice", "lime for garnish"], "steps": ["Combine chicken broth, onion, celery, carrots, parsley, pepper, thyme, and bay leaf in a Dutch oven; bring to a boil. Reduce heat to low; simmer until the onion and celery begin to soften, 10 to 15 minutes. Stir chicken into the simmering broth; cook until the chicken is no longer pink in the middle, 5 to 10 minutes. Remove and discard bay leaf. Stir rice and lime juice into the broth; cook and stir just until rice is hot and grains separate, about 1 minute. Garnish with lime slices.\n\n\n\n\n\n\n\n\n\n\n\nChristina"], "rating": null, "prep_time": "20 mins", "cook_time": "25 mins", "total_time": "45 mins", "nb_servings": "8"}, {"url": "https://www.allrecipes.com/recipe/15257/chicken-rice-and-vegetable-soup/", "name": "Chicken, Rice, and Vegetable Soup", "ingredients": ["5 cups water, or more as needed, divided", "1 (14.5 ounce) can chicken broth", "2  skinless, boneless chicken breast halves - cut into cubes", "3 medium carrots, chopped", "3 stalks celery, chopped", "1 medium onion, chopped", "2 cubes  chicken bouillon", "⅓ cup uncooked white rice", "salt and pepper to taste"], "steps": ["Combine 4 cups water and chicken broth in a large saucepan over high heat; bring to a boil. Add chicken, carrots, celery, onion, and bouillon cubes. Reduce the heat to low, cover, and simmer until vegetables are tender, about 15 minutes.", "Add rice and up to 1 cup water if necessary; simmer until rice is tender, about 15 minutes. Season with salt and pepper."], "rating": null, "prep_time": "20 mins", "cook_time": "35 mins", "total_time": "55 mins", "nb_servings": "4"}]