[
  {
    "url": "https://www.allrecipes.com/recipe/87434/grilled-fusion-pork-chops/",
    "name": "Grilled Fusion Pork Chops",
    "ingredients": [
      "¼ cup soy sauce",
      "¼ cup lime juice",
      "1 tablespoon garlic paste",
      "1 tablespoon ginger paste",
      "4  (1-inch-thick) pork chops",
      "1 tablespoon garam masala"
    ],
    "steps": [
      "In a bowl, stir together soy sauce, lime juice, garlic, and ginger.",
      "Place pork chops in a glass dish. Pour soy sauce mixture over chops. Cover, and refrigerate 2 to 3 hours, turning occasionally.",
      "Preheat an outdoor grill for direct heat and lightly oil grate.",
      "Place chops on the grill. As they cook, sprinkle with garam masala. Cook about 10 minutes on each side."
    ],
    "rating": null,
    "prep_time": "5 mins",
    "cook_time": "20 mins",
    "total_time": "3 hrs 25 mins",
    "nb_servings": "4",
    "country": "japan",
    "category":"nonveg"
  },
  {
    "url": "https://www.allrecipes.com/recipe/235957/mohawk-indian-corn-soup/",
    "name": "Mohawk Indian Corn Soup",
    "ingredients": [
      "1 tablespoon olive oil, or as needed",
      "1 ¾ pounds pork loin fillet, cut into 1-inch cubes",
      "6 cups water",
      "3 cubes beef bouillon",
      "3 cubes  chicken bouillon",
      "3 cups cubed rutabaga",
      "2 cups chopped carrots",
      "2 cups chopped celery",
      "2 (15.5 ounce) cans canned hominy, drained",
      "1 (15 ounce) can kidney beans, rinsed and drained",
      "salt and ground black pepper to taste"
    ],
    "steps": [
      "Heat olive oil in a large skillet over medium-high heat. Cook and stir pork in hot oil until browned on all sides, 5 to 10 minutes.",
      "Stir water, beef bouillon, and chicken bouillon together in a large pot over medium-high heat until bouillon dissolves. Add pork, rutabaga, carrots, and celery; bring mixture to a boil, reduce heat to medium-low, and simmer until vegetables tender, about 40 minutes.",
      "Stir hominy and kidney beans into pork-vegetable mixture and simmer until hominy and meat are tender, about 30 minutes more. Season with salt and ground black pepper."
    ],
    "rating": null,
    "prep_time": "20 mins",
    "cook_time": "1 hrs 10 mins",
    "total_time": "1 hrs 30 mins",
    "nb_servings": "6",
    "country": "india",
    "category":"veg"
  },
  {
    "url": "https://www.allrecipes.com/recipe/213255/curried-pork-chops-and-cauliflower-with-basmati-rice/",
    "name": "Curried Pork Chops and Cauliflower with Basmati Rice",
    "ingredients": [
      "3 cups water",
      "1 ½ cups uncooked basmati rice",
      "4 cups cauliflower florets",
      "4 (4 ounce) pork chops, trimmed",
      "4 teaspoons curry powder, divided",
      "salt and ground black pepper to taste",
      "1 teaspoon olive oil",
      "2 teaspoons all-purpose flour",
      "½ cup low-sodium chicken broth",
      "½ cup buttermilk",
      "¼ cup apple chutney",
      "6  green onions, chopped, divided"
    ],
    "steps": [
      "Bring water and rice to a boil in a saucepan over high heat. Reduce heat to medium-low, cover, and simmer until the rice is tender and the liquid has been absorbed, 20 to 25 minutes.",
      "Meanwhile, place a steamer insert into a saucepan and fill with water to just below the bottom of the steamer. Cover and bring the water to a boil over high heat. Add cauliflower, cover, and steam until just tender, 4 to 5 minutes depending on thickness. Remove from steamer and set aside.",
      "Season pork chops with 1 1/2 teaspoons curry powder, salt, and pepper. Heat olive oil in a large skillet over medium-high heat. Arrange pork chops in the skillet and cook until no longer pink in the center, about 3 minutes on each side. Place pork chops on a platter and cover to keep warm.",
      "Sprinkle remaining 2 1/2 teaspoons curry powder and flour into the same skillet. Whisk in chicken broth, buttermilk, and apple chutney. Continue cooking until the curry sauce has thickened.",
      "Stir in cauliflower and 1/2 of the green onion; cook until cauliflower is heated through.",
      "Place 3/4 cup cooked rice on each plate and top each portion with a pork chop. Spoon curry sauce over pork chops and sprinkle remaining green onions to garnish."
    ],
    "rating": null,
    "prep_time": "20 mins",
    "cook_time": "40 mins",
    "total_time": "1 hrs",
    "nb_servings": "4",
    "country": "india",
    "category":"nonveg"
  },
  {
    "url": "https://www.allrecipes.com/recipe/217331/goan-pork-vindaloo/",
    "name": "Goan Pork Vindaloo",
    "ingredients": [
      "16  dried Kashmiri chile peppers, stemmed and seeded",
      "1 (1 inch) piece cinnamon stick, broken into pieces",
      "1 teaspoon cumin seeds",
      "½ teaspoon whole black peppercorns",
      "½ teaspoon ground turmeric",
      "6  whole cloves",
      "1 tablespoon white vinegar",
      "salt to taste",
      "2 pounds boneless pork loin roast, trimmed and cut into 1-inch cubes",
      "¼ cup vegetable oil",
      "4 medium onions, chopped",
      "10 cloves garlic, minced, or more to taste",
      "1 (2 inch) piece fresh ginger root, minced",
      "2 cups boiling water",
      "¼ cup white vinegar",
      "2  green chile peppers, seeded and cut into strips"
    ],
    "steps": [
      "Grind Kashmiri chiles, cinnamon stick, cumin seeds, peppercorns, turmeric, and cloves with a mortar and pestle or electric coffee grinder until smooth. Mix in 1 tablespoon white vinegar to create a smooth paste; season with salt.",
      "Place pork in a large glass or ceramic bowl. Add spice paste and toss until pork is evenly coated. Cover and marinate in the refrigerator, 8 hours to overnight.",
      "When ready to cook, heat oil in a Dutch oven over medium-high heat. Add onions, garlic, and ginger; cook and stir until golden brown, about 10 minutes. Add pork and all marinade; cook, stirring frequently, until pork has firmed up, about 5 minutes. Pour in boiling water and bring to a simmer. Reduce the heat, then cover and cook until pork is tender, about 40 minutes.",
      "Stir in vinegar and green chiles; continue to cook, uncovered, until green chiles have softened and vindaloo has thickened, about 30 more minutes. Season with salt as necessary before serving."
    ],
    "rating": null,
    "prep_time": "35 mins",
    "cook_time": "1 hrs 30 mins",
    "total_time": "10 hrs 5 mins",
    "nb_servings": "8",
    "country": "nepal",
    "category":"nonveg"
  },
  {
    "url": "https://www.allrecipes.com/recipe/222992/indian-tacos-deluxe/",
    "name": "Indian Tacos Deluxe",
    "ingredients": [
      "1 tablespoon butter",
      "1  onion, chopped",
      "2 (15 ounce) cans pinto beans, undrained",
      "1 (15 ounce) can kidney beans, undrained",
      "1 (15 ounce) can pork and beans",
      "1 (16 ounce) can tomato sauce",
      "¼ cup water",
      "3 tablespoons sugar",
      "½ (1.25 ounce) package chili seasoning mix",
      "1 teaspoon chili powder",
      "½ teaspoon seasoned salt",
      "3 cups all-purpose flour",
      "2 tablespoons baking powder",
      "6 tablespoons white sugar",
      "½ teaspoon salt",
      "2 cups water, or as needed",
      "1 cup all-purpose flour",
      "3 cups vegetable oil for frying",
      "2 cups shredded lettuce",
      "2  tomatoes, chopped",
      "1 cup shredded Cheddar cheese",
      "1  onion, chopped",
      "½ cup sour cream"
    ],
    "steps": [
      "Melt butter in a skillet over medium heat and cook and stir 1 chopped onion in the melted butter until onion is translucent, about 5 minutes.",
      "Place a large saucepan over medium-high heat and pour in pinto beans, kidney beans, pork and beans, tomato sauce, cooked onion, and 1/4 cup water, stirring to combine. Bring the mixture to a boil, reduce heat to low, and stir in 3 tablespoons sugar, chili seasoning mix, chili powder, and seasoned salt. Let the chili simmer while you finish the remaining steps, 10 to 20 minutes. Stir chili occasionally.",
      "Mix 3 cups flour with baking powder, 6 tablespoons sugar, and salt in a large mixing bowl; stir in 2 cups of water or amount needed to make a workable dough. Spread 1 cup flour onto a work surface and scoop up about 1/4 cup of dough; drop it onto the flour and sprinkle surface with flour. Roll the dough into a flat round tortilla.",
      "Heat oil in a deep-fryer or large skillet to 375 degrees F (190 degrees C).",
      "Gently lay tortilla into the hot oil and deep fry until golden brown on both sides, 2 to 3 minutes per side. Dough will expand as it fries. Remove fry bread and drain on paper towels; continue to make and fry pieces of dough until all dough has been used.",
      "Place lettuce, tomatoes, Cheddar cheese, 1 chopped onion, and sour cream into separate bowls. To serve, spoon a ladle of chili onto each fry bread and sprinkle with desired garnishes; top each serving with a dollop of sour cream."
    ],
    "rating": null,
    "prep_time": "1 hrs",
    "cook_time": "45 mins",
    "total_time": "1 hrs 45 mins",
    "nb_servings": "12",
    "country": "mexico",
    "category":"nonveg"
  },
  {
    "url": "https://www.allrecipes.com/recipe/236773/pork-vindaloo/",
    "name": "Pork Vindaloo",
    "ingredients": [
      "1 large onion, roughly chopped",
      "1 (3 inch) piece fresh ginger, peeled and minced",
      "3 cloves garlic, peeled and crushed",
      "2 tablespoons mustard seeds",
      "1 tablespoon cumin seeds",
      "1  cinnamon stick",
      "8  whole black peppercorns",
      "4  whole cloves",
      "½ cup vinegar, divided, or to taste",
      "2 tablespoons water",
      "1 pound lean pork, cut into cubes",
      "3 tablespoons vegetable oil",
      "8  fresh curry leaves",
      "1 pound tomatoes, peeled and chopped",
      "1 ½ teaspoons ground turmeric",
      "salt to taste",
      "4 cups pork stock, or as needed",
      "3 sprigs cilantro"
    ],
    "steps": [
      "Grind onion, ginger, garlic, mustard seeds, cumin seeds, cinnamon stick, peppercorns, and cloves with just enough vinegar to keep the mixture moving in a blender or food processor until you have a thick paste.",
      "Mix remaining vinegar and water together in a large bowl. Add pork cubes to the bowl and thoroughly rinse the meat with the vinegar mixture; drain. Pat pork dry with paper towel.",
      "Mix the paste and pork cubes together in a clean bowl, assuring the pork cubes are coated in paste. Cover bowl with plastic wrap. Marinate in refrigerator 8 hours to overnight.",
      "Heat vegetable oil in a large skillet over medium-high heat. Fry curry leaves in hot oil until golden brown, 2 to 3 minutes. Add marinated pork, tomatoes, and turmeric; cook and stir until the tomatoes are completely softened, about 10 minutes.",
      "Season the pork mixture with salt. Pour enough pork stock over the mixture to assure everything is at least half-submerged. Bring the stock to a simmer, place a cover on the skillet, reduce heat to medium-low, and simmer until the pork is completely tender, 1 to 2 hours.",
      "Remove lid from skillet and continue to simmer the mixture until the sauce is very thick, about 10 minutes. Garnish with cilantro."
    ],
    "rating": null,
    "prep_time": "30 mins",
    "cook_time": "1 hrs 10 mins",
    "total_time": "9 hrs 40 mins",
    "nb_servings": "6",
    "country": "india",
    "category":"nonveg"
  },
  {
    "url": "https://www.allrecipes.com/recipe/159874/pork-chops-with-sweet-tomato-chutney/",
    "name": "Pork Chops with Sweet Tomato Chutney",
    "ingredients": [
      "2 tablespoons vegetable oil",
      "1 teaspoon cumin seeds",
      "½ teaspoon mustard seed",
      "1 (2 inch) piece cinnamon stick",
      "½ teaspoon fennel seeds",
      "6 large tomatoes, cut into 8 wedges",
      "1 teaspoon cayenne pepper",
      "1 teaspoon salt, or to taste",
      "1 cup water",
      "½ cup white sugar",
      "8  bone-in pork loin chops (1 inch thick)",
      "1 pinch salt and pepper to taste",
      "2 tablespoons vegetable oil"
    ],
    "steps": [
      "Heat 2 tablespoons of oil in a large skillet over medium heat. Add the cumin seed, mustard seed, and cinnamon stick. Cook and stir until seeds are fragrant and begin to pop, about 1 minute. Stir in the fennel seed and then add the tomatoes. Season with cayenne pepper and salt. Pour in the water, reduce heat to low, cover and simmer until the tomatoes are very soft, about 20 minutes.",
      "Stir the sugar in with the tomatoes and set the heat to high. Cook until sugar has dissolved, then continue to cook while stirring constantly until the mixture is glossy, about 3 minutes. Remove from the heat and set aside.",
      "Season the pork chops with salt and pepper. Heat the remaining oil in a large skillet over medium-high heat. Fry the pork chops on each side until browned and cooked through, about 4 minutes per side. Remove from the heat and allow to rest for a few minutes.",
      "Serve pork chops with about a tablespoon of chutney spooned over the top."
    ],
    "rating": null,
    "prep_time": "15 mins",
    "cook_time": "45 mins",
    "total_time": "1 hrs",
    "nb_servings": "4",
    "country": "china",
    "category":"nonveg"
  },
  {
    "url": "https://www.allrecipes.com/recipe/142967/easy-garam-masala/",
    "name": "Easy Garam Masala",
    "ingredients": [
      "1 tablespoon ground cumin",
      "1 ½ teaspoons ground coriander",
      "1 ½ teaspoons ground cardamom",
      "1 ½ teaspoons ground black pepper",
      "1 teaspoon ground cinnamon",
      "½ teaspoon ground cloves",
      "½ teaspoon ground nutmeg"
    ],
    "steps": [
      "Mix cumin, coriander, cardamom, pepper, cinnamon, cloves, and nutmeg in a bowl.",
      "Place mix in an airtight container, and store in a cool, dry place."
    ],
    "rating": null,
    "prep_time": "5 mins",
    "cook_time": "",
    "total_time": "5 mins",
    "nb_servings": "12",
    "country": "nepal",
    "category":"vegan"
  }
]